app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "service_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "casa"], ["service_id", 1], ["created_at", "2020-05-22 02:58:37.681652"], ["updated_at", "2020-05-22 02:58:37.681652"]]

  def new
    @category = Category.new
    @services = Service.all
---
SELECT "services".* FROM "services"

  def set_category
    @group = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]