app/controllers/services_controller.rb

  def index
    @service = Service.all
---
SELECT "services".* FROM "services"

  def create
    service = Service.new(name: params[:service][:name])
    service.save
---
INSERT INTO "services" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "casa"], ["created_at", "2020-05-14 03:04:35.460856"], ["updated_at", "2020-05-14 03:04:35.460856"]]

  def show
    @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def edit
    @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def update
    @service = Service.find(params[:id])
    @service.name = params[:service][:name]
    @service.save!
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "services" SET "name" = ?, "updated_at" = ? WHERE "services"."id" = ?  [["name", "avions"], ["updated_at", "2020-05-14 15:25:09.626613"], ["id", 13]]

  def destroy
    @service = Service.find(params[:id])
    @service.destroy
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "services" WHERE "services"."id" = ?  [["id", 14]]