app/views/categories/new.html.erb

SELECT "services".* FROM "services"
---

    <%= f.collection_select(:service_id, Service.all, :id, :name) %>